# Techniques for Cleaning Data

Data cleaning is a critically important step in any data analysis. In many cases, the data that we have available to us is not in the format that we need. Some common problems include:

 1. Removing Duplicates 
2. Filling in missing data
3. Converting data types
4. Parsing Dates
5. Inconsistent Data Entry

In [21]:
import pandas as pd
import numpy as np

In [22]:
# Let's start by creating a simple dataframe
data = pd.DataFrame({
    'name': ['Messi', 'Ronaldo', 'Neymar', 'Mbappe', 'Lingard', 'Messi'],
    'goals': [45, 40, 35.25, 30, 25, 10],
    'assists': [20, np.nan, 10, 5, 0, 20],
    'position': ['Forward', 'Forward', 'Forward', 'FWD', 'Midfielder', 'FWD'],
    'birth_date': ['1987-06-24 00:00:00', '1985-02-05', '1992-02-05', '1998-12-20', '1992-12-15', '1987-06-24 00:00:00']  
})

# as you can see, we have a lot of data cleaning to do
data

      name  goals  assists    position           birth_date
0    Messi  45.00     20.0     Forward  1987-06-24 00:00:00
1  Ronaldo  40.00      NaN     Forward           1985-02-05
2   Neymar  35.25     10.0     Forward           1992-02-05
3   Mbappe  30.00      5.0         FWD           1998-12-20
4  Lingard  25.00      0.0  Midfielder           1992-12-15
5    Messi  10.00     20.0         FWD  1987-06-24 00:00:00

In [23]:
# Let's add some duplicates
data = pd.concat([data, data])

In [24]:
data

      name  goals  assists    position           birth_date
0    Messi  45.00     20.0     Forward  1987-06-24 00:00:00
1  Ronaldo  40.00      NaN     Forward           1985-02-05
2   Neymar  35.25     10.0     Forward           1992-02-05
3   Mbappe  30.00      5.0         FWD           1998-12-20
4  Lingard  25.00      0.0  Midfielder           1992-12-15
5    Messi  10.00     20.0         FWD  1987-06-24 00:00:00
0    Messi  45.00     20.0     Forward  1987-06-24 00:00:00
1  Ronaldo  40.00      NaN     Forward           1985-02-05
2   Neymar  35.25     10.0     Forward           1992-02-05
3   Mbappe  30.00      5.0         FWD           1998-12-20
4  Lingard  25.00      0.0  Midfielder           1992-12-15
5    Messi  10.00     20.0         FWD  1987-06-24 00:00:00

In [25]:
# We can remove duplicates using the drop_duplicates method
data = data.drop_duplicates()
data

      name  goals  assists    position           birth_date
0    Messi  45.00     20.0     Forward  1987-06-24 00:00:00
1  Ronaldo  40.00      NaN     Forward           1985-02-05
2   Neymar  35.25     10.0     Forward           1992-02-05
3   Mbappe  30.00      5.0         FWD           1998-12-20
4  Lingard  25.00      0.0  Midfielder           1992-12-15
5    Messi  10.00     20.0         FWD  1987-06-24 00:00:00

In [26]:
# We can remove duplicates based on a subset of columns
data = data.drop_duplicates(subset=['name'], keep='first')
data

      name  goals  assists    position           birth_date
0    Messi  45.00     20.0     Forward  1987-06-24 00:00:00
1  Ronaldo  40.00      NaN     Forward           1985-02-05
2   Neymar  35.25     10.0     Forward           1992-02-05
3   Mbappe  30.00      5.0         FWD           1998-12-20
4  Lingard  25.00      0.0  Midfielder           1992-12-15

In [27]:
# We can fill in missing data using the fillna method
data['assists'] = data['assists'].fillna(0)
data

/var/folders/l3/wlgnl3zd5hl46kfjq1yh3k9r0000gn/T/ipykernel_6705/3605912877.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['assists'] = data['assists'].fillna(0)

      name  goals  assists    position           birth_date
0    Messi  45.00     20.0     Forward  1987-06-24 00:00:00
1  Ronaldo  40.00      0.0     Forward           1985-02-05
2   Neymar  35.25     10.0     Forward           1992-02-05
3   Mbappe  30.00      5.0         FWD           1998-12-20
4  Lingard  25.00      0.0  Midfielder           1992-12-15

In [29]:
# We can convert data types using the astype method
data['goals'] = data['goals'].astype(int) # Notice what happens to the .25 (rounds down)
data['assists'] = data['assists'].astype(int)
data

/var/folders/l3/wlgnl3zd5hl46kfjq1yh3k9r0000gn/T/ipykernel_6705/1605198956.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['goals'] = data['goals'].astype(int) # Notice what happens to the .25
/var/folders/l3/wlgnl3zd5hl46kfjq1yh3k9r0000gn/T/ipykernel_6705/1605198956.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['assists'] = data['assists'].astype(int)

      name  goals  assists    position           birth_date
0    Messi     45       20     Forward  1987-06-24 00:00:00
1  Ronaldo     40        0     Forward           1985-02-05
2   Neymar     35       10     Forward           1992-02-05
3   Mbappe     30        5         FWD           1998-12-20
4  Lingard     25        0  Midfielder           1992-12-15

In [31]:
# We can replace values using the replace method
data['position'] = data['position'].str.replace('FWD', 'Forward')
data

/var/folders/l3/wlgnl3zd5hl46kfjq1yh3k9r0000gn/T/ipykernel_6705/3951027099.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['position'] = data['position'].str.replace('FWD', 'Forward')

      name  goals  assists    position           birth_date
0    Messi     45       20     Forward  1987-06-24 00:00:00
1  Ronaldo     40        0     Forward           1985-02-05
2   Neymar     35       10     Forward           1992-02-05
3   Mbappe     30        5     Forward           1998-12-20
4  Lingard     25        0  Midfielder           1992-12-15

In [34]:
# We can parse dates using the to_datetime method
data['birth_date'] = pd.to_datetime(data['birth_date'], format='mixed')
data

/var/folders/l3/wlgnl3zd5hl46kfjq1yh3k9r0000gn/T/ipykernel_6705/799403440.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['birth_date'] = pd.to_datetime(data['birth_date'], format='mixed')

      name  goals  assists    position birth_date
0    Messi     45       20     Forward 1987-06-24
1  Ronaldo     40        0     Forward 1985-02-05
2   Neymar     35       10     Forward 1992-02-05
3   Mbappe     30        5     Forward 1998-12-20
4  Lingard     25        0  Midfielder 1992-12-15

In [37]:
# If we need to apply a custom function to a column, we can use the apply method
data['name'] = data['name'].apply(lambda x: x.upper())
data

/var/folders/l3/wlgnl3zd5hl46kfjq1yh3k9r0000gn/T/ipykernel_6705/2984511213.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['name'] = data['name'].apply(lambda x: x.upper())

      name  goals  assists    position birth_date
0    MESSI     45       20     Forward 1987-06-24
1  RONALDO     40        0     Forward 1985-02-05
2   NEYMAR     35       10     Forward 1992-02-05
3   MBAPPE     30        5     Forward 1998-12-20
4  LINGARD     25        0  Midfielder 1992-12-15